<a href="https://colab.research.google.com/github/atlas-github/fstep_19/blob/master/intro_to_bigdata%26ai.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Setup

1. What is Google Colab?
2. Click Connect
3. Try uploading a document
4. Explain Runtime types
5. Try a few settings

#Upload and view a spreadsheet

In [3]:
import pandas as pd
df = pd.read_csv("sample-users.csv")
df

          user_id  birth_year         country  user_settings     plan
0          user_0        1989          Poland              1  Regular
1          user_1        1975  United Kingdom              0  Regular
2          user_2        1987          Poland              0  Regular
3          user_3        1994          France              0  Regular
4          user_4        1985  United Kingdom              0  Regular
...           ...         ...             ...            ...      ...
16271  user_19425        1994         Ireland              0  Regular
16272  user_19426        1977         Estonia              0  Regular
16273  user_19427        1991          Poland              0  Regular
16274  user_19428        1984  United Kingdom              0  Regular
16275  user_19429        1995         Romania              0  Regular

[16276 rows x 5 columns]

#Build a simple [pivot table](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html)

In [26]:
import numpy as np 

table = pd.pivot_table(df, index = ['country'], values = 'user_settings', columns = ['plan'], aggfunc = 'count')
table

plan            Premium  Regular  Special
country
Denmark              22      409       15
Estonia              31      939       21
France              101     1925       84
Ireland              41     1137       36
Lithuania            10      630        6
Malta                17      510       21
Poland               41     2231       34
Portugal             16      577       11
Romania              78      966       52
United Kingdom      357     5809      149